TRACK_MAP = {
    "札幌": 1, "函館": 2, "福島": 3, "新潟": 4,
    "東京": 5, "中山": 6, "中京": 7, "京都": 8,
    "阪神": 9, "小倉": 10
}

TRACK_MAP_INV = {
    1: "札幌", 2: "函館", 3: "福島", 4: "新潟",
    5: "東京", 6: "中山", 7: "中京", 8: "京都",
    9: "阪神", 10: "小倉"
}

SURFACE_MAP = {"芝": 0, "ダ": 1}

CRS_DIRECTION_MAP = {"右": 0, "左": 1, "直線": 2}

CRS_LAYOUT_MAP = {"外": 0, "内": 1}

CRS_VARIANT_MAP = {"A": 0, "B": 1, "C": 2, "D": 3}

WEATHER_MAP = {"晴": 0, "曇": 1, "小雨": 2, "雨": 3, "小雪": 4, "雪": 5}

TRACK_COND_MAP = {"良": 0, "稍": 1, "重": 2, "不": 3}

STATUS_MAP = {"取消": 1, "中止": 2, "除外": 3, "失格": 4}

SEX_MAP = {"牡": 0, "牝": 1, "セ": 2}

MARGIN_MAP = {"同着": None, "ハナ": 0.05, "クビ": 0.10, "アタマ": 0.15, "大": 10.0}

STABLE_MAP = {"美浦": 0, "栗東": 1, "地方": 2}